# parameters
nc: 3  # number of classes #不能注释，但nc数取决于data中yaml
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
    #########rgb
   [-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9

    #########depth
   [-4, 1, Focus, [64, 3]],  # 10-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 11-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 13-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 15-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 17-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 19
   
#    ######### Add Block #############
#    [[4,14], 1, Add, [1]],    # two stream fuse
#    [[6,16], 1, Add, [1]],    # two stream fuse
#    [[9,19], 1, Add, [1]],    # two stream fuse
  ]

# YOLOv5 head
head:
  [
    ####rgb
   [-1, 1, Conv, [512, 1, 1]],          # 20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 21
   [[-1,6], 1, Concat, [1]],           # 22 cat backbone P4
   [-1, 3, C3, [512, False]],           # 23

   [-1, 1, Conv, [256, 1, 1]],          # 24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 25
   [[-1,4], 1, Concat, [1]],           # 26 cat backbone P3
   [-1, 3, C3, [256, False]],           # 27 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 28
   [[-1,24], 1, Concat, [1]],           # 29 cat head P4
   [-1, 3, C3, [512, False]],           # 30 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 31
   [[-1,20], 1, Concat, [1]],           # 32 cat head P5
   [-1, 3, C3, [1024, False]],          # 33 (P5/32-large)
   
    ####depth
   [19, 1, Conv, [512, 1, 1]],          # 34
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 35
   [[-1,16], 1, Concat, [1]],           # 36 cat backbone P4
   [-1, 3, C3, [512, False]],           # 37

   [-1, 1, Conv, [256, 1, 1]],          # 38
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 39
   [[-1,14], 1, Concat, [1]],           # 40 cat backbone P3
   [-1, 3, C3, [256, False]],           # 41 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 42
   [[-1,38], 1, Concat, [1]],           # 43 cat head P4
   [-1, 3, C3, [512, False]],           # 44 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 45
   [[-1,34], 1, Concat, [1]],           # 46 cat head P5
   [-1, 3, C3, [1024, False]],          # 47 (P5/32-large)
   
   ####
   [[44, 47, 50], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5) 48 depth
   [[30, 33, 36], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5) 49 add
   
   
   #[[65,66], 1, ConcatD, [1]],           #
   #[[68,67], 1, ConcatD, [1]],           #
   
  ]
