# parameters
nc: 3  # number of classes #不能注释，但nc数取决于data中yaml
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
   [-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9

    #########
   [-4, 1, Focus, [64, 3]],  # 10-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 11-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 13-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 15-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 17-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 19
   
   #########
   [-8, 1, Focus, [64, 3]],  # 20
   [-1, 1, Conv, [128, 3, 2]],  # 21
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 23
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 25
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 27
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 29
   
   ######### Add Block #############
   [[4,14], 1, BiFPN_Add2, [256,256]],    # 30 two stream fuse
   [[6,16], 1, BiFPN_Add2, [512,512]],    # 31 two stream fuse
   [[9,19], 1, BiFPN_Add2, [1024,1024]],    # 32 two stream fuse #rgb+depth
   
   [[14,24], 1, BiFPN_Add2, [256,256]],    # 33 two stream fuse
   [[16,26], 1, BiFPN_Add2, [512,512]],    # 34 two stream fuse
   [[19,29], 1, BiFPN_Add2, [1024,1024]],    # 35 two stream fuse #depth+jet2
   
   [[4,24], 1, BiFPN_Add2, [256,256]],    # 36 two stream fuse
   [[6,26], 1, BiFPN_Add2, [512,512]],    # 37 two stream fuse
   [[9,29], 1, BiFPN_Add2, [1024,1024]],    # 38 two stream fuse #rgb+jet2
  ]

# YOLOv5 head
head:
  [[38, 1, Conv, [512, 1, 1]],          # 39
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 
   [[-1,37], 1, BiFPN_Add2, [512,512]],           # 41 cat backbone P4
   [-1, 3, C3, [512, False]],           # 42

   [-1, 1, Conv, [256, 1, 1]],          # 43
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 
   [[-1,36,4], 1, BiFPN_Add3, [256,256]],           # 45 cat backbone P3
   [-1, 3, C3, [256, False]],           # 46 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 47
   [[-1,42,6], 1, BiFPN_Add3, [512,512]],           # 48 cat head P4
   [-1, 3, C3, [512, False]],           # 49 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 50
   [[-1,39], 1, BiFPN_Add2, [512,512]],           # 51 cat head P5
   [-1, 3, C3, [1024, False]],          # 52 (P5/32-large)
   
   ####
   [32, 1, Conv, [512, 1, 1]],          # 53
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 
   [[-1,31], 1, BiFPN_Add2, [512,512]],           # 55 cat backbone P4
   [-1, 3, C3, [512, False]],           # 56

   [-1, 1, Conv, [256, 1, 1]],          # 57
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 
   [[-1,30,4], 1, BiFPN_Add3, [256,256]],           # 59 cat backbone P3
   [-1, 3, C3, [256, False]],           # 60 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 61
   [[-1,56,6], 1, BiFPN_Add3, [512,512]],           # 62 cat head P4
   [-1, 3, C3, [512, False]],           # 63 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 64
   [[-1,53], 1, BiFPN_Add2, [512,512]],           # 65 cat head P5
   [-1, 3, C3, [1024, False]],          # 66 (P5/32-large)
   
   ####
   [35, 1, Conv, [512, 1, 1]],          # 67
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 
   [[-1,34], 1, BiFPN_Add2, [512,512]],           # 69 cat backbone P4
   [-1, 3, C3, [512, False]],           # 70

   [-1, 1, Conv, [256, 1, 1]],          # 71
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 
   [[-1,33,24], 1, BiFPN_Add3, [256,256]],           # 73 cat backbone P3
   [-1, 3, C3, [256, False]],           # 74 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 75
   [[-1,70,26], 1, BiFPN_Add3, [512,512]],           # 76 cat head P4
   [-1, 3, C3, [512, False]],           # 77 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 78
   [[-1,67], 1, BiFPN_Add2, [512,512]],           # 79 cat head P5
   [-1, 3, C3, [1024, False]],          # 80 (P5/32-large)
   
   
   ####
   [[46, 49, 52], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5) 81 rgb+jet2
   [[60, 63, 66], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5) 82 rgb+depth
   [[74, 77, 80], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5) 83 depth+jet2
   
  ]
